In [27]:
import pandas as pd

In [28]:
di={"person":['Mary','Juan','John'],'quarter':[4,5,1],'pennies':[56,25,30],'dimes':[15,7,20]}

In [29]:
goo=pd.DataFrame(di)

In [30]:
goo

  person  quarter  pennies  dimes
0   Mary        4       56     15
1   Juan        5       25      7
2   John        1       30     20

In [31]:
goo.index

RangeIndex(start=0, stop=3, step=1)

In [32]:
goo=goo.set_index("person")

In [33]:
goo.columns

Index(['quarter', 'pennies', 'dimes'], dtype='object')

In [34]:
goo.index

Index(['Mary', 'Juan', 'John'], dtype='object', name='person')

In [35]:
di2={"person":['Mary','Juan','John'],'nickel':[4,5,1]} 
goo2=pd.DataFrame(di2)

In [24]:
goo.reset_index()
goo2.reset_index()

   index person  nickel
0      0   Mary       4
1      1   Juan       5
2      2   John       1

In [25]:
goomerge=goo.merge(goo2, on='person')

In [26]:
goomerge

  person  quarter  pennies  dimes  nickel
0   Mary        4       56     15       4
1   Juan        5       25      7       5
2   John        1       30     20       1

In [40]:
goo.merge(goo2,left_index=True,right_index=True)

Empty DataFrame
Columns: [index, quarter, pennies, dimes, person, nickel]
Index: []